jayis1/ghostblade/firmware/rp2350b/src/rp2350b_init.c
/*
 * rp2350b_init.c — Low-Level Hardware Initialization for RP2350B
 *
 * Copyright (C) 2026 GhostBlade Project
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * This file implements the hardware initialization sequence for the RP2350B
 * coprocessor on the GhostBlade board. It configures:
 *
 *   1. System clocks (150 MHz core, 48 MHz peripheral, 133 MHz XIP)
 *   2. ARM Cortex-M33 FPU (CP10/CP11 enable)
 *   3. GPIO pin muxing for SPI0 slave, SPI1 master, SPI2 master, I2C, ADC
 *   4. SPI0 slave peripheral (50 MHz max, Mode 0, for RK3576 bridge)
 *   5. SPI1 master peripheral (10 MHz, for CC1101/LMS7002M)
 *   6. SPI2 master peripheral (10 MHz, for ST25R3916 NFC)
 *   7. ADC (ADC0 for battery voltage, ADC4 for temperature)
 *   8. UART0 (115200 8N1, debug console)
 *
 * After rp2350b_init() completes, all peripheral drivers can safely
 * call their respective init functions.
 *
 * Reference: RP2350B Datasheet, Sections 2 (Clocks), 4 (GPIO/ADC), 5 (SPI)
 */

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include "rp2350b_init.h"
#include "board_pins.h"
#include "cc1101_init.h"    /* CC1101_WRITE_BURST, CC1101_READ_BURST macros */

/* ========================================================================
 * RP2350B Register Base Addresses
 * ======================================================================== */

#define RP2350B_SYSCTL_BASE      0x400B0000UL
#define RP2350B_CLOCKS_BASE      0x400B0800UL
#define RP2350B_RESETS_BASE       0x400B0C00UL
#define RP2350B_PSM_BASE         0x400B1000UL
#define RP2350B_PADS_BASE        0x400C0000UL
#define RP2350B_IO_BANK0_BASE    0x400D0000UL
#define RP2350B_SPI0_BASE        0x48060000UL
#define RP2350B_SPI1_BASE        0x48070000UL
#define RP2350B_SPI2_BASE        0x48074000UL
#define RP2350B_UART0_BASE       0x48034000UL
#define RP2350B_ADC_BASE         0x50041000UL
#define RP2350B_I2C1_BASE        0x48044000UL
#define RP2350B_DMA_BASE         0x50000000UL

/* ========================================================================
 * System Control / Clocks Registers
 * ======================================================================== */

/* Clocks registers (offsets from CLOCKS_BASE) */
#define CLOCKS_REF_RESET          0x14
#define CLOCKS_REF_CTRL           0x10
#define CLOCKS_SYS_CTRL           0x20
#define CLOCKS_SYS_DIV            0x24
#define CLOCKS_PERI_CTRL          0x30
#define CLOCKS_PERI_DIV           0x34

/* Clock source selections */
#define CLOCKS_CLK_SRC_RO         0
#define CLOCKS_CLK_SRC_XOSC       1
#define CLOCKS_CLK_SRC_PLL_SYS    2
#define CLOCKS_CLK_SRC_PLL_USB    3

/* Reset registers (offsets from RESETS_BASE) */
#define RESETS_RESET              0x00
#define RESETS_RESET_DONE         0x08

/* Reset bits for peripherals */
#define RESETS_SPI0_RESET         (1 << 16)
#define RESETS_SPI1_RESET         (1 << 17)
#define RESETS_SPI2_RESET         (1 << 23)
#define RESETS_UART0_RESET        (1 << 8)
#define RESETS_ADC_RESET          (1 << 24)
#define RESETS_I2C1_RESET         (1 << 15)
#define RESETS_DMA_RESET          (1 << 2)
#define RESETS_PADS_BANK0_RESET   (1 << 25)
#define RESETS_IO_BANK0_RESET      (1 << 26)

/* ========================================================================
 * GPIO Function Select Values
 * ======================================================================== */

/* GPIO function assignments (5 bits per pin in IO_BANK0) */
#define GPIO_FUNC_SPI             1U
#define GPIO_FUNC_UART            2U
#define GPIO_FUNC_I2C             3U
#define GPIO_FUNC_PWM             4U
#define GPIO_FUNC_SIO             5U   /* Software-controlled GPIO */
#define GPIO_FUNC_PIO0            6U
#define GPIO_FUNC_PIO1            7U
#define GPIO_FUNC_CLOCK           8U
#define GPIO_FUNC_USB             9U
#define GPIO_FUNC_NONE            31U  /* Disconnect */

/* ========================================================================
 * SPI0 Slave Registers (offsets from SPI0_BASE)
 * ======================================================================== */

#define SPI0_SSPCR0               0x000   /* Control register 0 */
#define SPI0_SSPCR1               0x004   /* Control register 1 */
#define SPI0_SSPDR                0x008   /* Data register */
#define SPI0_SSPSR                0x00C   /* Status register */
#define SPI0_SSPCPSR              0x010   /* Clock prescale divisor */
#define SPI0_SSPDMACR             0x014   /* DMA control */
#define SPI0_SSPIMSC              0x018   /* Interrupt mask set/clear */
#define SPI0_SSPRIS               0x01C   /* Raw interrupt status */
#define SPI0_SSPMIS               0x020   /* Masked interrupt status */
#define SPI0_SSPICR               0x024   /* Interrupt clear */
#define SPI0_SSPPERIPHID0         0xFE0   /* Peripheral ID 0 */
#define SPI0_SSPPERIPHID1         0xFE4   /* Peripheral ID 1 */

/* SSPCR0 bits */
#define SSPCR0_DSS_SHIFT          0      /* Data size select (4-bit) */
#define SSPCR0_FRF_SHIFT          4      /* Frame format (2-bit) */
#define SSPCR0_SPO                (1 << 6)  /* SPI clock polarity */
#define SSPCR0_SPH                (1 << 7)  /* SPI clock phase */
#define SSPCR0_SCR_SHIFT          8      /* Serial clock rate (8-bit) */

/* SSPCR1 bits */
#define SSPCR1_LBM                (1 << 0)  /* Loop-back mode */
#define SSPCR1_SSE                (1 << 1)  /* SPI enable */
#define SSPCR1_MS                 (1 << 2)  /* Master/slave select: 0=master, 1=slave */
#define SSPCR1_SOD                (1 << 3)  /* Slave output disable */

/* SSPSR bits */
#define SSPSR_TFE                 (1 << 0)  /* TX FIFO empty */
#define SSPSR_TNF                 (1 << 1)  /* TX FIFO not full */
#define SSPSR_RNE                 (1 << 2)  /* RX FIFO not empty */
#define SSPSR_RFF                 (1 << 3)  /* RX FIFO full */
#define SSPSR_BSY                 (1 << 4)  /* SPI busy */

/* ========================================================================
 * SPI1/SPI2 Master Registers (RP2350B DW APB SSI, same layout as SPI0)
 * ======================================================================== */

/* SPI master control register values for 10 MHz clock */
#define SPI_MASTER_CLK_DIV        5       /* 48 MHz / (2 * (5+1)) = 4 MHz conservative */
#define SPI_MASTER_SCR             4       /* SCR=4 with CPSR=5 = ~2 MHz for CC1101 */

