jayis1/ghostblade/firmware/rp2350b/src/rp2350b_init.c
/* ========================================================================
 * UART0 Registers (offsets from UART0_BASE)
 * ======================================================================== */

#define UART0_DR                   0x000
#define UART0_RSR                  0x004
#define UART0_FR                   0x018
#define UART0_IBRD                 0x024
#define UART0_FBRD                 0x028
#define UART0_LCR_H               0x02C
#define UART0_CR                   0x030
#define UART0_IFLS                 0x034
#define UART0_IMSC                 0x038

/* ========================================================================
 * ADC Registers (offsets from ADC_BASE)
 * ======================================================================== */

#define ADC_CS                     0x00
#define ADC_RESULT                 0x04
#define ADC_FCS                    0x08

/* ADC_CS bits */
#define ADC_CS_EN                  (1 << 0)
#define ADC_CS_TS_EN               (1 << 1)
#define ADC_CS_START_ONCE          (1 << 2)
#define ADC_CS_START_MANY          (1 << 3)
#define ADC_CS_READY               (1 << 8)

/* ========================================================================
 * I2C1 Registers (offsets from I2C1_BASE)
 * ======================================================================== */

#define I2C1_IC_CON               0x000
#define I2C1_IC_TAR               0x004
#define I2C1_IC_DATA_CMD          0x010
#define I2C1_IC_STATUS            0x070
#define I2C1_IC_ENABLE            0x06C

/* ========================================================================
 * DMA Registers (offsets from DMA_BASE)
 * ======================================================================== */

#define DMA_CH0_READ_ADDR          0x000
#define DMA_CH0_WRITE_ADDR         0x004
#define DMA_CH0_TRANS_COUNT        0x008
#define DMA_CH0_CTRL_TRIG          0x00C
#define DMA_CH0_AL1_CTRL           0x010
#define DMA_CH1_READ_ADDR          0x040
#define DMA_CH1_WRITE_ADDR         0x044
#define DMA_CH1_TRANS_COUNT        0x048
#define DMA_CH1_CTRL_TRIG          0x04C
#define DMA_CHAN_EN                0x230
#define DMA_CHAN_EN0               0x230
#define DMA_INTS0                  0x240
#define DMA_INTE0                  0x244

/* DMA CTRL bits */
#define DMA_CTRL_EN                 (1 << 0)
#define DMA_CTRL_HIGH_PRIORITY      (1 << 1)
#define DMA_CTRL_INCR_READ          (1 << 4)
#define DMA_CTRL_INCR_WRITE         (1 << 5)
#define DMA_CTRL_DATA_SIZE_8         (0 << 2)
#define DMA_CTRL_DATA_SIZE_16        (1 << 2)
#define DMA_CTRL_DATA_SIZE_32        (2 << 2)
#define DMA_CTRL_IRQ_QUIET          (1 << 21)

/* ========================================================================
 * Helper Macros
 * ======================================================================== */

#define REG32(addr)               (*(volatile uint32_t *)(addr))
#define REG16(addr)               (*(volatile uint16_t *)(addr))
#define REG8(addr)                (*(volatile uint8_t *)(addr))

/* ========================================================================
 * SPI0 RX Ring Buffer (shared with spi_protocol.c)
 * ======================================================================== */

/* SPI0 slave receive ring buffer.
 * The SPI0 ISR fills this buffer from the SPI0 RX FIFO.
 * The protocol handler drains it in spi_protocol_process().
 * Size must be a power of 2. */
#define SPI0_RX_BUF_SIZE          8192

uint8_t spi_rx_buf[SPI0_RX_BUF_SIZE] __attribute__((aligned(4)));
volatile uint32_t spi_rx_head = 0;  /* ISR writes here */
volatile uint32_t spi_rx_tail = 0;  /* Protocol handler reads here */

/* ========================================================================
 * SPI0 Slave ISR Handler (for receiving from RK3576)
 * ======================================================================== */

/**
 * spi0_isr_handler — SPI0 slave interrupt service routine
 *
 * Called when the SPI0 RX FIFO contains data (from the RK3576 host).
 * Drains the FIFO into the ring buffer for later processing by
 * the protocol handler.
 *
 * The SPI0 peripheral on RP2350B is configured as a slave (SSP format).
 * The host (RK3576) drives SCK, CSn, and MOSI. We sample on the
 * rising edge of SCK (Mode 0).
 */
void spi0_isr_handler(void) {
    volatile uint32_t const *sr = (volatile uint32_t const *)(RP2350B_SPI0_BASE + SPI0_SSPSR);
    volatile uint32_t const *dr = (volatile uint32_t const *)(RP2350B_SPI0_BASE + SPI0_SSPDR);
    uint32_t max_iterations = 256;  /* Safety: limit bytes processed per ISR */

    /* Drain all available bytes from the SPI0 RX FIFO.
     * RNE (RX FIFO Not Empty) indicates data is available.
     * The max_iterations limit prevents an infinite loop if the RNE
     * bit is stuck due to a hardware fault. The RP2350B SSP has a
     * 16-entry RX FIFO, so 256 is far more than needed. */
    while ((*sr & SSPSR_RNE) && --max_iterations > 0) {
        uint8_t byte = (uint8_t)(*dr & 0xFF);

        /* Write byte to ring buffer if space available */
        uint32_t next_head = (spi_rx_head + 1) & (SPI0_RX_BUF_SIZE - 1);
        if (next_head != spi_rx_tail) {
            spi_rx_buf[spi_rx_head] = byte;
            spi_rx_head = next_head;
        }
        /* If ring buffer is full, byte is silently dropped.
         * This should never happen in normal operation because
         * the SPI protocol handler drains the buffer frequently. */
    }

    /* Data memory barrier to ensure ISR writes are visible to main loop */
    __asm__ volatile ("dmb" ::: "memory");

    /* Assert INT_REQ low to signal host we received data and may have
     * a response pending. The protocol handler deasserts INT_REQ
     * when the TX ring is empty. */
}

/* ========================================================================
 * GPIO Configuration
 * ======================================================================== */

/**
 * gpio_set_function — Set the function select for a GPIO pin
 *
 * @pin:      RP2350B pin number
 * @func_sel: Function select value (GPIO_FUNC_SIO, GPIO_FUNC_SPI, etc.)
 */
static void gpio_set_function(uint8_t pin, uint32_t func_sel) {
    /* IO_BANK0: 4 bytes per pin for function select */
    volatile uint32_t *ctrl = (volatile uint32_t *)(RP2350B_IO_BANK0_BASE + 0x04 + pin * 8);
    *ctrl = func_sel & 0x1F;
    __asm__ volatile ("dmb" ::: "memory");
}

/**
 * gpio_set_pull_up — Enable or disable pull-up on a GPIO pin
 *
 * @pin:      RP2350B pin number
 * @enable:   true = enable pull-up, false = disable
 */
static void gpio_set_pull_up(uint8_t pin, bool enable) {
    volatile uint32_t *pad_ctrl = (volatile uint32_t *)(RP2350B_PADS_BASE + 0x04 + pin * 4);
    if (enable) {
        *pad_ctrl |= (1 << 2);   /* PUE: Pull-Up Enable */
    } else {
        *pad_ctrl &= ~(1 << 2);
    }
    __asm__ volatile ("dmb" ::: "memory");
}

/**
 * gpio_set_pull_down — Enable or disable pull-down on a GPIO pin
 *
 * @pin:      RP2350B pin number
 * @enable:   true = enable pull-down, false = disable
 */
static void gpio_set_pull_down(uint8_t pin, bool enable) {
    volatile uint32_t *pad_ctrl = (volatile uint32_t *)(RP2350B_PADS_BASE + 0x04 + pin * 4);
    if (enable) {
        *pad_ctrl |= (1 << 3);   /* PDE: Pull-Down Enable */
    } else {
        *pad_ctrl &= ~(1 << 3);
    }
    __asm__ volatile ("dmb" ::: "memory");
}

/**
 * gpio_set_output_enable — Enable or disable output driver for a GPIO pin
 *
 * @pin:      RP2350B pin number
 * @enable:   true = enable output, false = input only
 */
static void gpio_set_output_enable(uint8_t pin, bool enable) {
    volatile uint32_t *pad_ctrl = (volatile uint32_t *)(RP2350B_PADS_BASE + 0x04 + pin * 4);
    if (enable) {
        *pad_ctrl &= ~(1 << 0);  /* ODE=0, output driver enabled */
    } else {
        *pad_ctrl |= (1 << 0);   /* Input-only mode */
    }
    __asm__ volatile ("dmb" ::: "memory");
}

