jayis1/ghostblade/firmware/rp2350b/src/rp2350b_init.c
/* ========================================================================
 * GPIO Public API (declared in rp2350b_init.h)
 * ======================================================================== */

/**
 * rp2350b_gpio_set — Set a GPIO output pin high or low
 *
 * @pin:   RP2350B pin number (see board_pins.h)
 * @value: true = drive high, false = drive low
 */
void rp2350b_gpio_set(uint8_t pin, bool value) {
    volatile uint32_t *out_reg = (volatile uint32_t *)(RP2350B_IO_BANK0_BASE + 0x0100);
    volatile uint32_t *out_set = (volatile uint32_t *)(RP2350B_IO_BANK0_BASE + 0x0104);
    volatile uint32_t *out_clr = (volatile uint32_t *)(RP2350B_IO_BANK0_BASE + 0x0108);

    if (value) {
        *out_set = (1UL << pin);
    } else {
        *out_clr = (1UL << pin);
    }
    __asm__ volatile ("dmb" ::: "memory");
}

/**
 * rp2350b_gpio_get — Read a GPIO input pin
 *
 * @pin:   RP2350B pin number
 * Returns: true if pin is high, false if low
 */
bool rp2350b_gpio_get(uint8_t pin) {
    volatile uint32_t const *in_reg = (volatile uint32_t const *)(RP2350B_IO_BANK0_BASE + 0x010C);
    __asm__ volatile ("dmb" ::: "memory");
    return !!(*in_reg & (1UL << pin));
}

/* ========================================================================
 * Peripheral Unreset Helper
 * ======================================================================== */

/**
 * unreset_block_wait — Bring peripherals out of reset and wait for completion
 *
 * @reset_mask: Bitmask of RESETS_RESET bits to deassert
 */
static void unreset_block_wait(uint32_t reset_mask) {
    volatile uint32_t *reset_reg = (volatile uint32_t *)(RP2350B_RESETS_BASE + RESETS_RESET);
    volatile uint32_t const *reset_done = (volatile uint32_t const *)(RP2350B_RESETS_BASE + RESETS_RESET_DONE);
    uint32_t timeout = 1000000;

    /* Deassert reset for specified peripherals */
    *reset_reg &= ~reset_mask;

    /* Wait for all specified peripherals to report reset done
     * (with timeout to prevent hanging if hardware is faulty) */
    while ((*reset_done & reset_mask) != reset_mask) {
        if (--timeout == 0)
            break;  /* Timeout: peripheral reset not completing */
    }
}

/* ========================================================================
 * SPI0 Slave Initialization
 * ======================================================================== */

/**
 * spi0_slave_init — Initialize SPI0 as a slave for RK3576 communication
 *
 * Configures SPI0 in slave mode, Mode 0 (CPOL=0, CPHA=0), 8-bit data.
 * The SPI0 ISR will be registered by the Pico SDK's interrupt handler.
 */
static void spi0_slave_init(void) {
    volatile uint32_t *cr0 = (volatile uint32_t *)(RP2350B_SPI0_BASE + SPI0_SSPCR0);
    volatile uint32_t *cr1 = (volatile uint32_t *)(RP2350B_SPI0_BASE + SPI0_SSPCR1);
    volatile uint32_t *cpsr = (volatile uint32_t *)(RP2350B_SPI0_BASE + SPI0_SSPCPSR);
    volatile uint32_t *dmacr = (volatile uint32_t *)(RP2350B_SPI0_BASE + SPI0_SSPDMACR);
    volatile uint32_t *imsc = (volatile uint32_t *)(RP2350B_SPI0_BASE + SPI0_SSPIMSC);

    /* Disable SPI0 before configuration */
    *cr1 = 0;

    /* Configure CR0:
     * - Data size: 8 bits (DSS=7, meaning 8-bit frames)
     * - Frame format: SPI (FRF=0)
     * - CPOL=0, CPHA=0 (SPI Mode 0)
     * - Serial clock rate: 0 (slave mode, clock from master) */
    *cr0 = (7 << SSPCR0_DSS_SHIFT)    /* 8-bit data */
         | (0 << SSPCR0_FRF_SHIFT)    /* SPI frame format */
                                       /* CPOL=0, CPHA=0: bits 6,7 cleared */
         | (0 << SSPCR0_SCR_SHIFT);  /* SCR=0 (slave, irrelevant) */

    /* Clock prescale divisor (slave mode: not used for clock gen,
     * but must be non-zero to avoid divide-by-zero) */
    *cpsr = 2;

    /* Enable RX FIFO DMA request for efficient ISR-driven transfers */
    *dmacr = (1 << 0);  /* RX DMA enable */

    /* Enable RX interrupt (RX FIFO not empty = data available) */
    *imsc = (1 << 2);  /* RXIM: RX FIFO interrupt mask */

    /* Enable SPI0 in slave mode with output enabled */
    *cr1 = SSPCR1_SSE | SSPCR1_MS;  /* SSE=1, MS=1 (slave mode) */

    /* Drain any stale data in RX FIFO */
    volatile uint32_t const *sr = (volatile uint32_t const *)(RP2350B_SPI0_BASE + SPI0_SSPSR);
    volatile uint32_t const *dr = (volatile uint32_t const *)(RP2350B_SPI0_BASE + SPI0_SSPDR);
    while (*sr & SSPSR_RNE) {
        (void)*dr;  /* Read and discard */
    }

    /* Reset ring buffer pointers */
    spi_rx_head = 0;
    spi_rx_tail = 0;
}

/* ========================================================================
 * SPI1 Master Initialization (for CC1101 and LMS7002M)
 * ======================================================================== */

/**
 * spi1_master_init — Initialize SPI1 as master for CC1101/LMS7002M
 *
 * Configures SPI1 in master mode, Mode 0, 8-bit data, ~2 MHz clock.
 * The CC1101 and LMS7002M share SPI1 with separate chip select lines.
 */
static void spi1_master_init(void) {
    volatile uint32_t *cr0 = (volatile uint32_t *)(RP2350B_SPI1_BASE + SPI0_SSPCR0);
    volatile uint32_t *cr1 = (volatile uint32_t *)(RP2350B_SPI1_BASE + SPI0_SSPCR1);
    volatile uint32_t *cpsr = (volatile uint32_t *)(RP2350B_SPI1_BASE + SPI0_SSPCPSR);

    /* Disable SPI1 before configuration */
    *cr1 = 0;

    /* Configure CR0:
     * - 8-bit data, SPI format, CPOL=0, CPHA=0 (Mode 0)
     * - SCR = 4 → clock = f_periph / (CPSR × (SCR+1)) */
    *cr0 = (7 << SSPCR0_DSS_SHIFT)
         | (0 << SSPCR0_FRF_SHIFT)
                                       /* CPOL=0, CPHA=0: bits 6,7 cleared */
         | (SPI_MASTER_SCR << SSPCR0_SCR_SHIFT);

    /* Clock prescale divisor:
     * SPI clock = f_periph / (CPSR × (SCR+1))
     * At 48 MHz peripheral: 48 MHz / (5 × 5) = 1.92 MHz ≈ 2 MHz */
    *cpsr = SPI_MASTER_CLK_DIV;

    /* Enable SPI1 in master mode */
    *cr1 = SSPCR1_SSE;  /* SSE=1, MS=0 (master) */
}

/* ========================================================================
 * SPI2 Master Initialization (for ST25R3916 NFC)
 * ======================================================================== */

/**
 * spi2_master_init — Initialize SPI2 as master for ST25R3916 NFC
 *
 * Configures SPI2 in master mode, Mode 0, 8-bit data, ~2 MHz clock.
 * ST25R3916 supports up to 10 MHz SPI, but we start conservative.
 */
static void spi2_master_init(void) {
    volatile uint32_t *cr0 = (volatile uint32_t *)(RP2350B_SPI2_BASE + SPI0_SSPCR0);
    volatile uint32_t *cr1 = (volatile uint32_t *)(RP2350B_SPI2_BASE + SPI0_SSPCR1);
    volatile uint32_t *cpsr = (volatile uint32_t *)(RP2350B_SPI2_BASE + SPI0_SSPCPSR);

    /* Disable SPI2 before configuration */
    *cr1 = 0;

    /* Same configuration as SPI1 */
    *cr0 = (7 << SSPCR0_DSS_SHIFT)
         | (0 << SSPCR0_FRF_SHIFT)
                                       /* CPOL=0, CPHA=0: bits 6,7 cleared */
         | (SPI_MASTER_SCR << SSPCR0_SCR_SHIFT);

