jayis1/ghostblade/firmware/rp2350b/src/rp2350b_init.c
    *cpsr = SPI_MASTER_CLK_DIV;

    /* Enable SPI2 in master mode */
    *cr1 = SSPCR1_SSE;
}

/* ========================================================================
 * ADC Initialization
 * ======================================================================== */

/**
 * adc_init — Initialize the RP2350B ADC peripheral
 *
 * Enables the ADC block and configures it for single-shot conversions
 * on channels 0 (battery voltage) and 4 (temperature sensor).
 */
static void adc_init(void) {
    volatile uint32_t *cs = (volatile uint32_t *)(RP2350B_ADC_BASE + ADC_CS);

    /* Enable ADC */
    *cs = ADC_CS_EN;

    /* Small delay for ADC to stabilize */
    for (volatile int i = 0; i < 1000; i++)
        __asm__("nop");
}

/* ========================================================================
 * I2C1 Initialization (for ST25R3916 secondary control)
 * ======================================================================== */

/**
 * i2c1_init — Initialize I2C1 for ST25R3916 secondary control bus
 *
 * Configures I2C1 as master at 400 kHz (Fast-Mode Plus).
 * The ST25R3916 I2C address is 0xAC (7-bit: 0x56).
 */
static void i2c1_init(void) {
    volatile uint32_t *ic_con = (volatile uint32_t *)(RP2350B_I2C1_BASE + I2C1_IC_CON);
    volatile uint32_t *ic_enable = (volatile uint32_t *)(RP2350B_I2C1_BASE + I2C1_IC_ENABLE);

    /* Disable I2C before configuration */
    *ic_enable = 0;

    /* Configure:
     * - Master mode
     * - 400 kHz (Fast-Mode Plus)
     * - 7-bit addressing
     * - IC_CON: MASTER=1, SPEED=2 (fast mode), 7BIT=1, RESTART=1 */
    *ic_con = (1 << 0)   /* MASTER: master mode */
            | (2 << 1)    /* SPEED: fast mode (400 kHz) */
            | (1 << 4)    /* 7BIT: 7-bit addressing */
            | (1 << 5)    /* RESTART: enable restart */
            | (1 << 6);   /* SLAVE_DISABLE: disable slave */

    /* Enable I2C */
    *ic_enable = 1;
}

/* ========================================================================
 * GPIO Pin Mux Configuration
 * ======================================================================== */

/**
 * configure_gpio_pins — Set up all GPIO pin functions and pull-ups/pull-downs
 *
 * Configures each pin according to the board pin assignments in board_pins.h.
 */
static void configure_gpio_pins(void) {
    /* ── SPI0 Slave (bridge to RK3576) ──────────────────────────────── */
    gpio_set_function(PIN_SPI0_RX,   GPIO_FUNC_SPI);  /* SPI0 RX (MISO) */
    gpio_set_function(PIN_SPI0_CSN,  GPIO_FUNC_SPI);  /* SPI0 CSn */
    gpio_set_function(PIN_SPI0_SCK,  GPIO_FUNC_SPI);  /* SPI0 SCK */
    gpio_set_function(PIN_SPI0_TX,   GPIO_FUNC_SPI);  /* SPI0 TX (MOSI) */

    /* Pull-ups on CSn and SCK (slave inputs should have pull-ups) */
    gpio_set_pull_up(PIN_SPI0_CSN, true);
    gpio_set_pull_up(PIN_SPI0_SCK, true);

    /* ── Interrupt and Control Signals ───────────────────────────────── */
    gpio_set_function(PIN_INT_REQ,  GPIO_FUNC_SIO);  /* INT_REQ output */
    gpio_set_function(PIN_HOST_RDY, GPIO_FUNC_SIO);  /* HOST_RDY input */
    gpio_set_function(PIN_MCU_RUN,  GPIO_FUNC_SIO);  /* MCU_RUN input */

    /* INT_REQ: Output, initially HIGH (deasserted, active-low) */
    gpio_set_output_enable(PIN_INT_REQ, true);
    rp2350b_gpio_set(PIN_INT_REQ, true);

    /* HOST_RDY: Input with pull-up (active-low) */
    gpio_set_output_enable(PIN_HOST_RDY, false);
    gpio_set_pull_up(PIN_HOST_RDY, true);

    /* MCU_RUN: Input with pull-up (active-low reset) */
    gpio_set_output_enable(PIN_MCU_RUN, false);
    gpio_set_pull_up(PIN_MCU_RUN, true);

    /* ── Antenna Switch (PE42422) ───────────────────────────────────── */
    gpio_set_function(PIN_ANT_SEL0, GPIO_FUNC_SIO);
    gpio_set_function(PIN_ANT_SEL1, GPIO_FUNC_SIO);
    gpio_set_output_enable(PIN_ANT_SEL0, true);
    gpio_set_output_enable(PIN_ANT_SEL1, true);
    /* Default: MIMO RX path (V1=0, V2=1 → RF2) */
    rp2350b_gpio_set(PIN_ANT_SEL0, false);
    rp2350b_gpio_set(PIN_ANT_SEL1, true);

    /* ── SDR Control (LMS7002M via SPI1) ────────────────────────────── */
    gpio_set_function(PIN_SDR_SPI_SCK,  GPIO_FUNC_SPI);  /* SPI1 SCK */
    gpio_set_function(PIN_SDR_SPI_TX,   GPIO_FUNC_SPI);  /* SPI1 TX (MOSI) */
    gpio_set_function(PIN_SDR_SPI_RX,   GPIO_FUNC_SPI);  /* SPI1 RX (MISO) */
    gpio_set_function(PIN_SDR_SPI_CSN,  GPIO_FUNC_SIO);  /* GPIO chip select */
    gpio_set_function(PIN_SDR_RESET,    GPIO_FUNC_SIO);
    gpio_set_function(PIN_SDR_GPIO0,    GPIO_FUNC_SIO);  /* TX enable */
    gpio_set_function(PIN_SDR_GPIO1,    GPIO_FUNC_SIO);  /* RX enable */
    gpio_set_function(PIN_SDR_LNA_EN,   GPIO_FUNC_SIO);  /* LNA enable */

    /* SDR chip select: Output, initially HIGH (deselected) */
    gpio_set_output_enable(PIN_SDR_SPI_CSN, true);
    rp2350b_gpio_set(PIN_SDR_SPI_CSN, true);

    /* SDR reset: Output, initially LOW (in reset) */
    gpio_set_output_enable(PIN_SDR_RESET, true);
    rp2350b_gpio_set(PIN_SDR_RESET, false);

    /* SDR GPIOs: Outputs, initially disabled */
    gpio_set_output_enable(PIN_SDR_GPIO0, true);
    gpio_set_output_enable(PIN_SDR_GPIO1, true);
    gpio_set_output_enable(PIN_SDR_LNA_EN, true);
    rp2350b_gpio_set(PIN_SDR_GPIO0, false);
    rp2350b_gpio_set(PIN_SDR_GPIO1, false);
    rp2350b_gpio_set(PIN_SDR_LNA_EN, false);

    /* ── CC1101 Sub-GHz Radio (shared SPI1 bus) ─────────────────────── */
    gpio_set_function(PIN_CC_SPI_SCK,  GPIO_FUNC_SPI);  /* SPI1 SCK (shared) */
    gpio_set_function(PIN_CC_SPI_TX,   GPIO_FUNC_SPI);  /* SPI1 TX (shared) */
    gpio_set_function(PIN_CC_SPI_RX,   GPIO_FUNC_SPI);  /* SPI1 RX (shared) */
    gpio_set_function(PIN_CC_SPI_CSN,  GPIO_FUNC_SIO);  /* GPIO chip select */
    gpio_set_function(PIN_CC_GDO0,     GPIO_FUNC_SIO);  /* GDO0 input */
    gpio_set_function(PIN_CC_GDO2,     GPIO_FUNC_SIO);  /* GDO2 input */

    /* CC1101 chip select: Output, initially HIGH (deselected) */
    gpio_set_output_enable(PIN_CC_SPI_CSN, true);
    rp2350b_gpio_set(PIN_CC_SPI_CSN, true);

    /* CC1101 GDO pins: Inputs with pull-ups */
    gpio_set_output_enable(PIN_CC_GDO0, false);
    gpio_set_output_enable(PIN_CC_GDO2, false);
    gpio_set_pull_up(PIN_CC_GDO0, true);
    gpio_set_pull_up(PIN_CC_GDO2, true);

