jayis1/ghostblade/firmware/rp2350b/src/rp2350b_init.c
    /* ── ST25R3916 NFC Controller (SPI2 + I2C1) ──────────────────────── */
    gpio_set_function(PIN_NFC_SPI_SCK, GPIO_FUNC_SPI);  /* SPI2 SCK */
    gpio_set_function(PIN_NFC_SPI_TX,  GPIO_FUNC_SPI);  /* SPI2 TX (MOSI) */
    gpio_set_function(PIN_NFC_SPI_RX,  GPIO_FUNC_SPI);  /* SPI2 RX (MISO) */
    gpio_set_function(PIN_NFC_SPI_CSN, GPIO_FUNC_SIO); /* GPIO chip select */
    gpio_set_function(PIN_NFC_IRQ,    GPIO_FUNC_SIO);  /* IRQ input */

    /* NFC chip select: Output, initially HIGH (deselected) */
    gpio_set_output_enable(PIN_NFC_SPI_CSN, true);
    rp2350b_gpio_set(PIN_NFC_SPI_CSN, true);

    /* NFC IRQ: Input with pull-up (active-low) */
    gpio_set_output_enable(PIN_NFC_IRQ, false);
    gpio_set_pull_up(PIN_NFC_IRQ, true);

    /* ── I2C1 (NFC secondary control) ────────────────────────────────── */
    gpio_set_function(PIN_I2C_SDA, GPIO_FUNC_I2C);
    gpio_set_function(PIN_I2C_SCL, GPIO_FUNC_I2C);

    /* ── ADC Channels ───────────────────────────────────────────────── */
    /* ADC0 (battery voltage divider) and ADC4 (temperature sensor) are
     * configured by the ADC init, not by GPIO function select. The RP2350B
     * ADC inputs are on dedicated pins that don't need function select. */

    /* ── UART0 (debug console) ──────────────────────────────────────── */
    gpio_set_function(PIN_UART_TX, GPIO_FUNC_UART);
    gpio_set_function(PIN_UART_RX, GPIO_FUNC_UART);
    gpio_set_pull_up(PIN_UART_RX, true);
}

/* ========================================================================
 * Main Initialization
 * ======================================================================== */

/**
 * rp2350b_init — Initialize all low-level hardware for the GhostBlade board
 *
 * This function is called once at boot before any peripheral drivers.
 * It performs the following sequence:
 *
 *   1. Release peripherals from reset (SPI0, SPI1, SPI2, UART0, ADC, I2C1, DMA)
 *   2. Configure GPIO pin muxing for all board functions
 *   3. Initialize SPI0 as slave for RK3576 bridge communication
 *   4. Initialize SPI1 as master for CC1101 and LMS7002M
 *   5. Initialize SPI2 as master for ST25R3916 NFC
 *   6. Initialize ADC for battery and temperature monitoring
 *   7. Initialize I2C1 for ST25R3916 secondary control
 *   8. Release SDR from reset (LMS7002M)
 *
 * After this function returns, all peripheral drivers can safely
 * call their respective init functions.
 */
void rp2350b_init(void) {
    /* Step 1: Release peripherals from reset.
     * On the RP2350B, peripherals are held in reset by default after
     * POR. We must deassert their reset signals before configuring. */
    unreset_block_wait(
        RESETS_SPI0_RESET |
        RESETS_SPI1_RESET |
        RESETS_SPI2_RESET |
        RESETS_UART0_RESET |
        RESETS_ADC_RESET |
        RESETS_I2C1_RESET |
        RESETS_DMA_RESET |
        RESETS_PADS_BANK0_RESET |
        RESETS_IO_BANK0_RESET
    );

    /* Step 2: Configure GPIO pin muxing.
     * Must be done after peripherals are out of reset. */
    configure_gpio_pins();

    /* Step 3: Initialize SPI0 slave (bridge to RK3576).
     * The SPI0 slave peripheral must be ready before the protocol handler
     * and before the RK3576 driver attempts to communicate. */
    spi0_slave_init();

    /* Step 4: Initialize SPI1 master (CC1101/LMS7002M).
     * Must be ready before cc1101_init() and lms7002m_driver_init(). */
    spi1_master_init();

    /* Step 5: Initialize SPI2 master (ST25R3916 NFC).
     * Must be ready before st25r3916_init(). */
    spi2_master_init();

    /* Step 6: Initialize ADC.
     * Must be ready before battery_monitor_init(). */
    adc_init();

    /* Step 7: Initialize I2C1 (NFC secondary control).
     * The I2C bus is used for ST25R3916 auxiliary control. */
    i2c1_init();

    /* Step 8: Release SDR (LMS7002M) from reset.
     * The LMS7002M is held in reset by PIN_SDR_RESET (active-low).
     * Release it after SPI1 is initialized so it can be configured. */
    rp2350b_gpio_set(PIN_SDR_RESET, true);  /* Active-low: HIGH = released */

    /* Allow SDR to stabilize after reset release (~1 ms) */
    for (volatile int i = 0; i < 15000; i++)
        __asm__("nop");
}

/* ========================================================================
 * SPI1/SPI2 Platform Functions (called by CC1101 and NFC drivers)
 * ======================================================================== */

/**
 * CC1101 SPI1 Transfer Functions
 *
 * The CC1101 shares SPI1 with the LMS7002M. These functions manage the
 * chip select lines and perform SPI transfers.
 */

/* SPI1 data register for master transfers */
#define SPI1_SSPDR               (RP2350B_SPI1_BASE + 0x008)
#define SPI1_SSPSR               (RP2350B_SPI1_BASE + 0x00C)

/**
 * apex_cc1101_cs_assert — Assert CC1101 chip select (active-low)
 */
void apex_cc1101_cs_assert(void) {
    rp2350b_gpio_set(PIN_CC_SPI_CSN, false);  /* CSn active-low */
    /* Small delay for CS setup time (CC1101 requires >50 ns) */
    for (volatile int i = 0; i < 2; i++)
        __asm__("nop");
}

/**
 * apex_cc1101_cs_release — Release CC1101 chip select
 */
void apex_cc1101_cs_release(void) {
    rp2350b_gpio_set(PIN_CC_SPI_CSN, true);  /* CSn inactive-high */
}

/**
 * apex_cc1101_spi_xfer — Transfer one byte to/from CC1101 via SPI1
 *
 * @tx_byte: Byte to send
 * Returns: Byte received from CC1101
 */
uint8_t apex_cc1101_spi_xfer(uint8_t tx_byte) {
    volatile uint32_t *dr = (volatile uint32_t *)SPI1_SSPDR;
    volatile uint32_t const *sr = (volatile uint32_t const *)SPI1_SSPSR;
    uint32_t timeout;

    /* Wait until TX FIFO has space (with timeout to prevent hang) */
    timeout = 100000;
    while (!(*sr & SSPSR_TNF))
        if (--timeout == 0)
            return 0xFF;  /* SPI bus stuck */

    /* Write byte to TX FIFO */
    *dr = (uint32_t)tx_byte;

    /* Wait until RX FIFO has data (with timeout) */
    timeout = 100000;
    while (!(*sr & SSPSR_RNE))
        if (--timeout == 0)
            return 0xFF;  /* SPI transfer timeout */

    /* Read received byte from RX FIFO */
    return (uint8_t)(*dr & 0xFF);
}

/**
 * apex_cc1101_write_burst — Write multiple bytes to CC1101 registers
 *
 * @addr: Start register address
 * @data: Pointer to data buffer
 * @len:  Number of bytes to write
 */
void apex_cc1101_write_burst(uint8_t addr, const uint8_t *data, uint8_t len) {
    apex_cc1101_cs_assert();
    /* Send burst write header byte */
    apex_cc1101_spi_xfer(CC1101_WRITE_BURST(addr));
    /* Send data bytes */
    for (uint8_t i = 0; i < len; i++) {
        apex_cc1101_spi_xfer(data[i]);
    }
    apex_cc1101_cs_release();
}

/**
 * apex_cc1101_read_burst — Read multiple bytes from CC1101 registers
 *
 * @addr: Start register address
 * @data: Pointer to data buffer (output)
 * @len:  Number of bytes to read
 */
void apex_cc1101_read_burst(uint8_t addr, uint8_t *data, uint8_t len) {
    apex_cc1101_cs_assert();
    /* Send burst read header byte */
    apex_cc1101_spi_xfer(CC1101_READ_BURST(addr));
    /* Read data bytes (send dummy 0x00 while clocking in data) */
    for (uint8_t i = 0; i < len; i++) {
        data[i] = apex_cc1101_spi_xfer(0x00);
    }
    apex_cc1101_cs_release();
}

