jayis1/ghostblade/firmware/rp2350b/src/rp2350b_init.c
/* ========================================================================
 * Antenna Switch Control
 * ======================================================================== */

/**
 * apex_antenna_select — Select the active antenna path on the PE42422 switch
 *
 * @ant_id: Antenna selection (0=MIMO_TX, 1=MIMO_RX, 2=SUBGHZ, 3=TERMINATED)
 *
 * PE42422 truth table:
 *   V1=0, V2=0 → RF1 (MIMO TX)
 *   V1=1, V2=0 → RF2 (MIMO RX)
 *   V1=0, V2=1 → RF3 (Sub-GHz)
 *   V1=1, V2=1 → RF4 (Terminated 50Ω)
 */
void apex_antenna_select(uint8_t ant_id) {
    switch (ant_id) {
    case 0:  /* MIMO TX (RF1) */
        rp2350b_gpio_set(PIN_ANT_SEL0, false);
        rp2350b_gpio_set(PIN_ANT_SEL1, false);
        break;
    case 1:  /* MIMO RX (RF2) */
        rp2350b_gpio_set(PIN_ANT_SEL0, true);
        rp2350b_gpio_set(PIN_ANT_SEL1, false);
        break;
    case 2:  /* Sub-GHz (RF3) */
        rp2350b_gpio_set(PIN_ANT_SEL0, false);
        rp2350b_gpio_set(PIN_ANT_SEL1, true);
        break;
    case 3:  /* Terminated 50Ω (RF4) */
        rp2350b_gpio_set(PIN_ANT_SEL0, true);
        rp2350b_gpio_set(PIN_ANT_SEL1, true);
        break;
    default:
        break;
    }
}

/* ========================================================================
 * SDR GPIO Control Functions (called by SPI protocol handler)
 * ======================================================================== */

/**
 * apex_sdr_reset_assert — Assert LMS7002M reset (active-low)
 */
void apex_sdr_reset_assert(void) {
    rp2350b_gpio_set(PIN_SDR_RESET, false);  /* Active-low: LOW = reset */
}

/**
 * apex_sdr_reset_release — Release LMS7002M reset
 */
void apex_sdr_reset_release(void) {
    rp2350b_gpio_set(PIN_SDR_RESET, true);   /* Active-low: HIGH = normal */
}

/**
 * apex_sdr_tx_enable — Enable or disable LMS7002M TX path
 */
void apex_sdr_tx_enable(bool enable) {
    rp2350b_gpio_set(PIN_SDR_GPIO0, enable);
}

/**
 * apex_sdr_rx_enable — Enable or disable LMS7002M RX path
 */
void apex_sdr_rx_enable(bool enable) {
    rp2350b_gpio_set(PIN_SDR_GPIO1, enable);
}

/**
 * apex_sdr_lna_enable — Enable or disable external LNA
 */
void apex_sdr_lna_enable(bool enable) {
    rp2350b_gpio_set(PIN_SDR_LNA_EN, enable);
}

/* ========================================================================
 * ST25R3916 SPI2 Transfer Functions (for NFC controller)
 * ======================================================================== */

#define SPI2_SSPDR               (RP2350B_SPI2_BASE + 0x008)
#define SPI2_SSPSR               (RP2350B_SPI2_BASE + 0x00C)

/* ST25R3916 SPI protocol address byte encoding:
 *   Bit 7: 1 = Read, 0 = Write
 *   Bit 6: 1 = Burst (auto-increment), 0 = Single
 *   Bits 5:0: Register address or command */

/**
 * apex_nfc_cs_assert — Assert ST25R3916 chip select (active-low)
 */
void apex_nfc_cs_assert(void) {
    rp2350b_gpio_set(PIN_NFC_SPI_CSN, false);
    for (volatile int i = 0; i < 2; i++)
        __asm__("nop");
}

/**
 * apex_nfc_cs_release — Release ST25R3916 chip select
 */
void apex_nfc_cs_release(void) {
    rp2350b_gpio_set(PIN_NFC_SPI_CSN, true);
}

/**
 * apex_nfc_spi_xfer — Transfer one byte to/from ST25R3916 via SPI2
 *
 * @tx_byte: Byte to send
 * Returns: Byte received from ST25R3916
 */
uint8_t apex_nfc_spi_xfer(uint8_t tx_byte) {
    volatile uint32_t *dr = (volatile uint32_t *)SPI2_SSPDR;
    volatile uint32_t const *sr = (volatile uint32_t const *)SPI2_SSPSR;
    uint32_t timeout;

    /* Wait until TX FIFO has space (with timeout to prevent hang) */
    timeout = 100000;
    while (!(*sr & SSPSR_TNF))
        if (--timeout == 0)
            return 0xFF;  /* SPI bus stuck */

    /* Write byte to TX FIFO */
    *dr = (uint32_t)tx_byte;

    /* Wait until RX FIFO has data (with timeout) */
    timeout = 100000;
    while (!(*sr & SSPSR_RNE))
        if (--timeout == 0)
            return 0xFF;  /* SPI transfer timeout */

    /* Read received byte from RX FIFO */
    return (uint8_t)(*dr & 0xFF);
}

/**
 * apex_nfc_write_register — Write a single byte to ST25R3916 via SPI2
 *
 * This is the platform-specific implementation used by st25r3916_init.c.
 * The ST25R3916 SPI protocol sends the address byte first, then the data byte.
 */
void apex_nfc_write_register(uint8_t addr, uint8_t val) {
    apex_nfc_cs_assert();
    /* Write single: bit7=0, bit6=0, addr[5:0] */
    apex_nfc_spi_xfer((uint8_t)(addr & 0x3F));
    apex_nfc_spi_xfer(val);
    apex_nfc_cs_release();
}

/**
 * apex_nfc_read_register — Read a single byte from ST25R3916 via SPI2
 */
uint8_t apex_nfc_read_register(uint8_t addr) {
    uint8_t val;
    apex_nfc_cs_assert();
    /* Read single: bit7=1, bit6=0, addr[5:0] */
    apex_nfc_spi_xfer((uint8_t)((addr & 0x3F) | 0x80));
    val = apex_nfc_spi_xfer(0x00);
    apex_nfc_cs_release();
    return val;
}